# Apply - apply custom a function along any axis of the dataframe

In [9]:
import pandas as pd
import numpy as np
data = {'first_name': ['Jack', 'Meena', 'Sudhir', 'Amy', 'Leena'],
       'age' : [23,56,75,12,18],
       'city': ['Mumbai', 'Boston', 'Sydney', 'Boston', 'Delhi']}
df = pd.DataFrame(data, columns = ['first_name', 'age', 'city'])
df

  first_name  age    city
0       Jack   23  Mumbai
1      Meena   56  Boston
2     Sudhir   75  Sydney
3        Amy   12  Boston
4      Leena   18   Delhi

In [7]:
capitalizer = lambda x : x.upper()
df['FN'] = df['first_name'].apply(capitalizer)
df

  first_name  age    city      FN
0       Jack   23  Mumbai    JACK
1      Meena   56  Boston   MEENA
2     Sudhir   75  Sydney  SUDHIR
3        Amy   12  Boston     AMY
4      Leena   18   Delhi   LEENA

# ApplyMap - apply a function to each element of dataframe

In [8]:
data1 = {'height': [74,52,1,6,12],
        'age': [23,56,75,12,18]}
df1 = pd.DataFrame(data1, columns = ['height', 'age'])
df1

   height  age
0      74   23
1      52   56
2       1   75
3       6   12
4      12   18

In [11]:
df1.applymap(np.sqrt)

     height       age
0  8.602325  4.795832
1  7.211103  7.483315
2  1.000000  8.660254
3  2.449490  3.464102
4  3.464102  4.242641